<a href="https://colab.research.google.com/github/WaquarH/my-scratch/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

In [ ]:
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b','c'])

In [ ]:
df2 = pd.DataFrame(data,  columns=['a', 'b1','b'])

In [ ]:
print(df1)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [ ]:
df2

   a  b1   b
0  1 NaN   2
1  5 NaN  10

In [ ]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1,
2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [ ]:
d

{'one': a    1
 b    2
 c    3
 dtype: int64, 'two': a    1
 b    2
 c    3
 d    4
 dtype: int64}

In [ ]:
df=pd.DataFrame(d)

In [ ]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
df['three']=pd.Series([10,20,30],index=['a','b','c'])

In [ ]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [ ]:
df['four']=df['two']+df['three']

In [ ]:
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [ ]:
df=df.dropna()

In [ ]:
df['mul']=df['one']*df['two']

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df

   one  two  three  four  mul
a  1.0    1   10.0  11.0  1.0
b  2.0    2   20.0  22.0  4.0
c  3.0    3   30.0  33.0  9.0

In [ ]:
del df['four']

In [ ]:
df

   one  two  three  mul
a  1.0    1   10.0  1.0
b  2.0    2   20.0  4.0
c  3.0    3   30.0  9.0

In [ ]:
k=df.pop('mul')

In [ ]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0

In [ ]:
k.head()

a    1.0
b    4.0
c    9.0
Name: mul, dtype: float64

In [ ]:
df[1:2:2:3]

SyntaxError: ignored

In [ ]:
Df2 = pd.DataFrame([[5,6,40], [7,80,35]],index=['a','b'], columns = ['one','three','two'])

In [ ]:
df=df.append(Df2)

In [ ]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
x  5.0   40    6.0
y  7.0   35   80.0
a  5.0   40    6.0
b  7.0   35   80.0

In [ ]:
df.idxmax()

one      y
two      x
three    y
dtype: object

In [ ]:
df=df.drop('x')

In [ ]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
y  7.0   35   80.0
a  5.0   40    6.0
b  7.0   35   80.0

In [ ]:
df=df.drop('y')

In [ ]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
a  5.0   40    6.0
b  7.0   35   80.0

In [ ]:
df.idxmax()

one      b
two      a
three    b
dtype: object

In [ ]:
import numpy as np

In [ ]:
df1 =pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])

In [ ]:
df1

       col1      col2      col3
0  1.589371  0.270793  1.572620
1  0.184797  0.587940 -1.000171
2  0.435261 -1.402334 -0.485742
3 -1.495786  0.271753 -1.299575
4 -1.660358  0.696715  1.117757
5  1.380255  1.362038  0.337326
6 -0.388481  1.104538 -0.143297
7 -0.501288 -0.037007  0.196639
8 -0.731495  1.548332  1.862119
9 -0.794886 -2.325082  0.495932

In [ ]:
df2 =pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])
df1= df1.reindex_like(df2)
print(df1)

       col1      col2      col3
0  1.589371  0.270793  1.572620
1  0.184797  0.587940 -1.000171
2  0.435261 -1.402334 -0.485742
3 -1.495786  0.271753 -1.299575
4 -1.660358  0.696715  1.117757
5  1.380255  1.362038  0.337326
6 -0.388481  1.104538 -0.143297

In [ ]:
cat = pd.Categorical(['a', 'b', 'c', 'a', 'x', 'c'])

In [ ]:
cat

['a', 'b', 'c', 'a', 'x', 'c']
Categories (4, object): ['a', 'b', 'c', 'x']

In [ ]:
cat = pd.Categorical(["a", "x", "c", "x"], categories=["b", "a", "c","x","y"])

In [ ]:
cat

['a', 'x', 'c', 'x']
Categories (5, object): ['b', 'a', 'c', 'x', 'y']

In [ ]:

df = pd.DataFrame({"cat":cat, "s":["a", "c", "t", "a"]})

In [ ]:
df

  cat  s
0   a  a
1   x  c
2   c  t
3   x  a

In [ ]:

df.describe()

       cat  s
count    4  4
unique   3  3
top      x  a
freq     2  2